eventFlow.dot
strict digraph {
    spos [label="Sufficient participants\nOrganizer set"]
    spno [label="Sufficient participants\nNo organizer"]
    mpos [label="Missing participants\nOrganizer set"]
    mpno [label="Missing participants\nNo organizer"]
    fbno [label="Fully booked\nNo organizer"]
    fbos [label="Fully booked\nOrganizer set"]
    c [label="Cancled\nAction: Remove all participants\nand organizer from event"]
    d [label="Deleted"]
    i [label="Init"]

    spos -> spno [label="c2|m2,m3"]
    spos -> mpos [label="c4|m2\lc9|m2"]
    spno -> spos [label="c1|m1"]
    mpos -> spos [label="c3|m1\lc10|m1"]
    mpos -> mpno [label="c2|"]
    mpno -> mpos [label="c1|"]
    mpno -> spno [label="c3|m3\lc10|m3"]
    spno -> mpno [label="c4|m2\lc9|m2"]
    spos -> fbos [label="c3|m7\lc12|m7"]
    spno -> fbno [label="c3|m7\lc12|m7"]
    fbno -> fbos [label="c1|m1"]
    fbno -> spno [label="c4|\lc11|"]
    fbos -> fbno [label="c2|m2,m3"]
    fbos -> spos [label="c4|\lc11|"]
    fbos -> c [label="c6|m4"]
    fbno -> c [label="c6|m4"]
    spno -> c [label="c6|m4"]
    spno -> spno [label="c3|"]
    mpos -> c [label="c6|m4"]
    mpos -> fbos [label="c3|m1,m7"]
    mpno -> fbno [label="c3|m1,m3,m7"]
    mpno -> c [label="c6|m4"]
    spos -> c [label="c6|m4"]
    spos -> spos [label="c3|"]
    c -> mpno [label="c7|m5"]
    c -> spno [label="c7|m3,m5"]
    c -> d [label="c8|"]
    i -> spos [label="c5|m6"]
    i -> spno [label="c5|m6"]
    i -> mpos [label="c5|m6"]
    i -> mpno [label="c5|m6"]
    i -> fbno [label="c5|m3,m6,m7"]
    i -> fbos [label="c5|m6,m7"]

    condition [shape=record, label="{Condition|c1 Organizer set\lc2 Organizer reset\lc3 Participant added\lc4 Participant removed\lc5 New event created\lc6 Event cancled\lc7 Event cancle undone\lc8 Event deleted\lc9 p_min increased to p_min\>p\lc10 p_min decreased to p_min\≤p\lc11 p_max increased to p_max\> p\lc12 p_max decreased to p_max\≤p\l}"]
    mail [shape=record, label="{Mail messages|m1 'Confirmed open' to all participants and organizer of event\lm2 'Pending if open' to all participants and organizer of event'\lm3 'Event with sufficient participants is missing organizer' to all organizers\lm4 'Cancled' to all participants and organizer of event\lm5 'Not cancled' to all participants and organizer of event\lm6 'New event' to all accounts\lm7 'Fully booked' to all organizers\l}"]
    participants [shape=record, label="{Participants p\lp\≥0\n0\≤p_min\≤p_max|Missing participants\lp\<p_min\nSufficient participants\lp\≥p_min\np\<p_max\nFully booked\lp\≥p_max}"]

edge[ style=invis]
mail -> condition -> participants
    
}
